Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཀུན་སྣང་དང་བ་དང་། ཚད་མེད་སྣང་བ་དང་། སྣང་བ་ཆུང་ངུའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the devas in the Ābhāsvara, Apramāṇābha, and Parīttābha paradises issuing forth and ripening beings.

source: ཚངས་ཆེན་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་རིས་ཀྱི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the devas in the Mahābrahma, Brahmapurohita, and Brahmapārṣada paradises issuing forth and ripening beings.

source: དབང་སྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the deva king Vaśavartin and his devas and apsarases issuing forth and ripening beings.

source: ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ལྷ་མོའི་ཚོགས་དང་། ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the deva king Sunirmita and his devas and apsarases issuing forth and ripening beings.

source: རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the deva king Saṃtuṣita and his devas and apsarases issuing forth and ripening beings.

source: རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the deva king Suyāma and his devas and apsarases issuing forth and ripening beings.

source: ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ལྷ་མོའི་ཚོགས་དང་། ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the deva king Śakra and his devas and apsarases issuing forth and ripening beings.

source: དྲི་ཟའི་རྒྱལ་པོ་གནས་སྲུང་པོ་དང་། དྲི་ཟའི་བུ་དང་། དྲི་ཟའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the gandharva king Dhṛtarāṣṭra and his male gandharvas and female gandharvas issuing forth and ripening beings.

source: གྲུལ་བུམ་གྱི་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ་དང་། གྲུལ་བུམ་གྱི་བུ་དང་གྲུལ་བུམ་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the kumbhāṇḍa king Virūḍhaka and his male kumbhāṇḍas and female kumbhāṇḍas issuing forth and ripening beings.

source: ཀླུའི་རྒྱལ་པོ་མིག་མི་བཟང་དང་། ཀླུའི་བུ་དང་། ཀླུའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the nāga king Virūpākṣa and his male nāgas and female nāgas issuing forth and ripening beings.

source: གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཆེན་པོ་ངལ་བསོ་པོ་དང་། གནོད་སྦྱིན་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the great yakṣa king Vaiśravaṇa and his male yakṣas and female yakṣas issuing forth and ripening beings.

source: མིའམ་ཅིའི་རྒྱལ་པོསྡོང་པོ་དང་། མི་འམ་ཅིའི་བུ་དང་། མིའམ་ཅིའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the kinnara king Druma and his male kinnaras and female kinnaras issuing forth and ripening beings.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་བློ་གྲོས་བཟང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་དང་། ལྟོ་འཕྱི་ཆེན་པོའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the mahoraga lord Sumati and his male mahoragas and female mahoragas issuing forth and ripening beings.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཤུགས་དྲག་སྟོབས་ཆེན་དང་། ནམ་མཁའ་ལྡིང་གི་བུ་དང་ནམ་མཁའ་ལྡིང་གི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the garuḍa lord Mahā­bala­vega­sthāma and his male garuḍas and female garuḍas issuing forth and ripening beings.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ལྷ་མ་ཡིན་གྱི་བུ་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the asura lord Rāhu and his male asuras and female asuras issuing forth and ripening beings.

source: ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེ་དང་། གཤིན་རྗེའི་བུ་དང་། གཤིན་རྗེའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the Dharma king Yama and his male yamas and female yamas issuing forth and ripening beings.

source: མིའི་དབང་པོ་དང་སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the lord of humans and his male humans and female humans issuing forth and ripening beings.

source: དེ་བཞིན་དུ་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་ཐོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: Thus he saw clouds of bodies that were like those of all the beings that appear in all existences issuing forth and ripening beings.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་དྲང་སྲོང་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of śrāvakas, pratyeka­buddhas, and ṛṣis issuing forth and ripening beings.

source: རླུང་དང་ཆུ་དང་མེའི་ཕུང་པོ་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །རྒྱ་མཚོ་དང་། ཆུ་ཀླུང་དང་། རི་དང་།
en: He saw clouds of bodies that were like the devas of the realms of wind, water, and fire issuing forth and ripening beings.

source: ནགས་ཚལ་དང་། ལོ་ཏོག་དང་། སྨན་དང་། ཤིང་དང་། སའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བཟའ་ཤིང་གི་ར་བ་དང་།
en: He saw clouds of bodies that were like those of the devas of oceans, rivers, mountains, forests, harvests, herbs, trees, and earth issuing forth and ripening beings.

source: གྲོང་ཁྱེར་དང་། སྙིང་པོ་བྱང་ཆུབ་དང་། ཉིན་པར་དང་། མཚན་མོ་དང་། ནམ་མཁའ་དང་། ཕྱོགས་དང་། རྐང་གིས་འགྲོ་བ་དང་། ལུས་ཀྱི་རིས་སུ་གཏོགས་པ་དང་། ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་།
en: He saw clouds of bodies that were like those of the devas of parks, cities, the bodhimaṇḍa, the day, the night, space, directions, those who walk on legs, and all those who have bodies issuing forth and ripening beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་བ་ནས། དེ་བཞིན་དུ་ལག་ན་རྡོ་རྗེ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། ཕྱོགས་བཅུར་རྒྱས་པར་བཀང་སྟེ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་བར་དུ་མཐོང་སྟེ། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་སེམས་ཐོག་མ་བསྐྱེད་པའི་ཚོགས་ལ་སྩོགས་པའི་སྔོན་གྱི། ཚེ་རབས་ལ་ཡོངས་སུ་བསྒྲུབས་པའི་དགེ་བའི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ། རྒྱུན་མ་ཆད་པའི་ཚུལ་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བསྔགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཤི་འཕོ་དང་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ལུས་ཡོངས་སུ་བཟུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། མིང་གི་འཁོར་ལོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གན་དུ་འགྲོ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སངས་རྒྱས་བྱུང་སྟེ་བསྙེན་བཀུར་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཆོས་ཀྱི་ཚིག་དང་། ཡི་གེ་བླངས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ནན་ཏན་གྱི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཏིང་ངེ་འཛིན་ཐོབ་པས་སངས་རྒྱས་མཐོང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཞིང་མཐོང་བའི་མིག་གི་རྒྱས་པར་བཀང་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བསྐལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་འདབ་ཆགས་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་ལྟ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོར་གཏོགས་པའི་སེམས་ཅན་ཕ་རོལ་གྱི་ཤི་འཕོ་དང་།
en: In the same way, he saw clouds of bodies that were like Vajrapāṇi issuing forth, spreading throughout the ten directions, being present before beings throughout the extent of the ways of the realm of phenomena, and ripening beings.

source: སྐྱེ་བ་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ལྷའི་རྣ་བ་ཡོངས་སུ་དག་པ་རྟོགས་པར་བྱེད་པའི་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ལ་རྣམ་པར་བལྟ་ཞིང་དབྱིངས་ལ་འཇུག་པའི་སྒོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་ལྷའི་མིག་ལ་ཞུགས་པའི་སྒོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་ལྷའི་རྣ་བ་རྣམ་པར་དམིགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་སེམས་ཅན་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་བདག་དང་སེམས་ཅན་ཕ་རོལ་གྱི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་དངོས་པོ་མེད་པ་ལ་རབ་ཏུ་གནས་ཏེ། མངོན་པར་འདུ་བྱ་བ་མྱེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་རྐྱེན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆག་པ་དང་། རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་གནོན་པས། ཕྱོགས་རྒྱས་པ་འགེངས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོབ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོའི་ཚུལ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་འཇུག་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་གནོན་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་འཇུག་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་ནས། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སྤྲུལ་པའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཏོ། །སེམས་ཅན་རྣམས་ལ་ཆོས་འཆད་པ་དང་། ཡང་དག་པར་སྟོན་པ་དང་། གསལ་བར་བྱེད་པ་དང་། ཡོངས་སུ་སྟོན་པ་དང་། རྗེས་སུ་རྗོད་པ་དང་། རབ་ཏུ་འབྱེད་པ་དང་།
en: He saw, beginning with the night goddess Pramudita­nayana­jagad­virocanā’s first accumulation of the development of the aspiration to enlightenment, the unbroken succession of the accomplishment of a virtuous mind in her past lifetimes; the constant succession of praising the aspiration to enlightenment; the constant succession of passing away and obtaining a rebirth; the constant succession of the possession of a body; the constant succession of the wheel of names; the constant succession of going to a kalyāṇamitra; the constant succession of honoring the appearance of a buddha; the constant succession of acquiring the sentences and syllables of the Dharma; the constant succession of the motivation to practice the bodhisattva path; the constant succession of attaining samādhi; the constant succession of seeing buddhas through having attained samādhi; the constant succession of the expanding vision that sees the realms; the constant wheel of the knowledge of the succession of the kalpas; the constant succession of the knowledge that comprehends the realm of phenomena; the constant succession of seeing the natures of beings; the constant succession of knowing the successive passing and rebirth of beings who are within the ocean of the ways of the realm of phenomena; the constant succession of understanding pure divine hearing; the constant succession of the gateways for entering into the continuum of looking into the minds of the entire realm of beings; the constant succession of gateways for first entering divine sight; the constant succession of the first perception through divine hearing; the constant succession of the first knowledge of the minds of other beings; the constant succession of the first knowledge of the memory of the previous lifetimes of herself and others; the constant succession of the first conditions for attaining miraculous activity through being established in the absence of existence; the constant succession of spreading the prowess of miraculous powers throughout the directions; the constant succession of attaining bodhisattva liberations; the constant succession of realizing the inconceivable ways of an ocean of bodhisattva liberations; the constant succession of the miraculous manifestations of bodhisattva samādhi; the constant succession of bodhisattva prowess; the constant succession of bodhisattva domination; the constant succession of gaining the title of bodhisattva; the constant succession of entering the bodhisattva path; and the night goddess Pramudita­nayana­jagad­virocanā’s constant succession of bodhisattva knowledge all issued from all her pores as clouds of emanated bodies that he then saw teaching the Dharma to beings.

source: ཤིན་ཏུ་རྒྱ་ཆེར་བྱེད་པ་དང་། འགྲང་བ་དང་། ངེས་པར་སྟོན་པ་དང་། རྣམ་པར་རིག་པར་བྱེད་པ་དང་། ཉེ་བར་བསྒྲུབ་པ་མཐོང་སྟེ། ལ་ལ་ལ་ནི་རླུང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་འཁྲུགས་པའི་སྒྲ་སྐད་ཀྱིས་ཆོས་སྟོན་པར་མཐོང་ངོ་། །ལ་ལ་ལ་ནི་ཆུའི་ཕུང་པོ་རབ་ཏུ་རློབ་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མེའི་མེ་ལྕེ་ཤིན་ཏུ་རློབ་པའི་སྒྲ་སྐད་ཀྱིས།
en: He saw them declaring it, elucidating it, revealing it, communicating it, categorizing it, expanding upon it, enumerating it, giving instruction on it, making it known, and accomplishing it.

source: ལ་ལ་ལ་ནི་རྒྱ་མཚོའི་འབྲུག་གི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ས་ཡོངས་སུ་གཡོས་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་རི་ཆེན་པོ་ཕན་ཚུན་ཐུག་ཅིང་འཐབ་པའི་སྒྲ་སྐད་ཀྱིས་ལ་ལ་ལ་ནི་ལྷའི་གྲོང་ཁྱེར་གཡོས་པའི་ང་རོ་སྙན་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷའི་གཞལ་མེད་ཁང་འཐུབ་ཅིང་འཁྲོལ་བའི་སྒྲ་སྐད་ཀྱིས་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ལ་ལ་ལ་ནི་ལྷའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ཀླུའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་གནོད་སྦྱིན་གྱི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་དྲི་ཟའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མིའམ་ཅིའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མིའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ཚངས་པའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་མོའི་གླུའི་དབྱངས་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་རྫས་ཀྱི་རོལ་མོ་ལེགས་པར་བླངས་པའི་དབྱངས་ཀྱིས།
en: He saw some teaching the Dharma through speech from the sound of shaking in a domain of wind, some through speech from the sound of crashing waves on a mass of water, some through speech from the sound of the roaring flames of a fire, some through speech from the sound of a roaring ocean, some through speech from the sound of the rumbling of an earthquake, some through speech from the sound and noise of great mountains striking against and buffeting one another, some through speech from the melodious sound of the shaking of the cities of the devas, some through speech from the sound of divine aerial palaces buffeting one another, some through the speech of the lords of the devas; some through the speech of the lords of the nāgas, some through the speech of the lords of the yakṣas, some through the speech of the lords of the gandharvas, some through the speech of the lords of the asuras, some through the speech of the lords of the garuḍas, some through the speech of the lords of the mahoragas, some through the speech of the lords of the kinnaras, some through the speech of the lords of the humans, some through the speech of the lords of the Brahmā devas, some through the speech of the songs of the apsarases, some through speech from the playing of divine music, some through speech sounding from precious jewels, and some through the speech of all the various classes of beings, describing to beings the scope of the liberation of the night goddess Pramudita­nayana­jagad­virocanā.

source: ལ་ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེའི་སྒྲ་དབྱངས་ཀྱི། ལ་ལ་ལ་ནི་སེམས་ཅན་གྱི་རིས་ཐམས་ཅད་ཀྱི་སྐད་སྣ་ཚོགས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྣམ་པར་ཐར་པའི་ཡུལ་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་རྗོད་པ་མཐོང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་སྤྲིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་སྐད་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་སྐུའི་སྤྲིན་གྱིས་དེ་བཞིན་གཤེགས་པའི་གསུང་རྣམ་པ་ཐ་དད་པའི་དབྱངས་ཀྱི་ཡན་ལག་གི་ཚུལ་གྱིས་མཚན་མོའི་ལ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྣམ་པར་ཐར་པའི་ཡུལ་ཐོག་མ་སེམས་བསྐྱེད་པ་དང་བཅས་པ་ཡོངས་སུ་བྱུང་སྟེ། གྲུབ་ཅིང་ཡང་དག་པར་འདུས་པ་དང་བཅས་རྣམ་པར་ཐར་པའི་རྣམ་པར་རྩེ་བ་དང་བཅས་པ།
en: In the same way, he saw clouds of bodhisattva bodies with various kinds of bodhisattva speech and clouds of emanated tathāgatas, with the ways of the aspects of voice of the different kinds of speech of each tathāgata and describing to all beings the range of the liberation of the night goddess Pramudita­nayana­jagad­virocanā, including the first occurrence of developing the aspiration to enlightenment and the accumulation of accomplishments.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་དམིགས་པར་བྱེད་པ་མཐོང་ངོ་། །དེའི་སྤྲུལ་པའི་གཟུགས་ཀྱི་སྤྲིན་རེ་རེས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་རྣམ་པར་སྦྱོང་བ་མཐོང་ངོ་། །
en: He saw that each of those clouds of emanated forms purified, in each instant of mind, an anabhilāpyānabhilāpya of buddha realms in the world realms in the ten directions.

source: སེམས་ཅན་རྒྱ་མཚོ་མཐའ་ཡས་པ་དག་ཀྱང་ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་རྣམ་པར་འགྲེལ་པ་མཐོང་ངོ་། །
en: He saw them liberating an infinite ocean of beings from all the sufferings of the lower realms.

source: སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་། དབུས་མེད་པ་དག་ཀྱང་མིའི་ཕུན་སུམ་ཚོགས་པ་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་། །
en: He saw them establishing realms of beings, without limit or center, in the good fortune of devas and humans.

source: སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་འཁོར་བའི་རྒྱ་མཚོ་ལས་གྱེན་དུ་བསྐྱོད་པ་མཐོང་ངོ་། །
en: He saw them freeing an ocean of beings, without limit or center, from the ocean of saṃsāra.

source: སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་། །
en: He saw them establishing an ocean of beings without limit or center on the śrāvaka and pratyeka­buddha levels.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་སྟོབས་བཅུའི་ཡེ་ཤེས་ཀྱི་སར་འཛུད་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །
en: Sudhana, the head merchant’s son, saw them bringing, in each instant of mind, an ocean of beings, without limit or center, to the level of the ten strengths.

source: ཐོས་སོ་རྣམ་པར་དཔྱད་དོ། །ཞུགས་སོ་ཁོང་དུ་ཆུད་དོ། །ངེས་པར་རྟོགས་སོ། །རྗེས་སུ་ཤེས་སོ། །རྗེས་སུ་འབྲངས་སོ། །རྗེས་སུ་ཞུགས་སོ། །མཉམ་པ་ཉིད་དུ་བྱིན་གྱིས་བརླབས་ཏེ།
en: He heard them, contemplated them, scrutinized them, comprehended them, understood them, knew them, followed them, fathomed them, and was resolved as to their equality.

source: དེ་ནི་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོས་དགའ་བ་ཤིན་ཏུ་ཡངས་པའི་རྒྱ་མཚོ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བའི་བྱིན་དང་། སྔོན་སྐལ་པ་མཉམ་པར་སྤྱད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་བརླབས་པ་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོའི་སྣོད་དུ་གྱུར་པའི་ཕྱིར་རོ། །
en: This was because of the night goddess Pramudita­nayana­jagad­virocanā’s having become an appropriate vessel for the completely good bodhisattva conduct, her supremacy through the miracles of the bodhisattva liberation called the vast bannerof inconceivable, completely good joy, her corresponding practice in the past, her being blessed by the blessings of the tathāgatas, and the ripening of her countless roots of merit.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་དགའ་བའི་ཤུགས་དྲག་པོ་གང་ཆེན་མཚོ་སྣང་བ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དེས། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །རྒྱལ་པའི་ཆོས་རྣམས་ཤིན་ཏུ་ཟབ། །
en: Then Sudhana, the head merchant’s son, who had attained the illumination of an ocean of the power of great bodhisattva joy, who had been blessed by all the tathāgatas in the ten directions, placed his hands together in homage and praised the night goddess Pramudita­nayana­jagad­virocanā with these appropriate verses: “The Dharma of the jinas is profound.

source: དེ་ལ་ཁྱོད་ཀྱིས་བསྐལ་པ་ཚད་མེད་བསླབས། །
en: You trained in it for countless kalpas.

source: བསམ་པ་ཇི་བཞིན་གཟུགས་རྣམས་ཀྱིས། །འགྲོ་བ་ཀུན་བཀང་འཇིག་རྟེན་རིམ་པས་བསྟན། །
en: In successive forms that accord with dispositions, You pervade all beings and appear in worlds.

source: བདག་མེད་མགོན་མེད་ལོག་པ་ཡི། །འདུ་ཤེས་རྟག་ཏུ་འཁྲུལ་པ་མཁྱེན་གྱུར་ནས། །རྫུ་འཕྲུལ་རྣམ་པ་དུ་མ་ཡིས། །ལུས་དང་དབང་ཕྱུག་སྟོན་མཛད་འགྲོ་བ་འདུལ། །
en: {1} “Knowing that they have no self and no protector, Have incorrect conceptions, and are continually deluded, You guide beings by manifesting bodies and powers Through various kinds of miracles.

source: ཤིན་ཏུ་རིམས་བྲལ་རབ་ཏུ་ཞི། །ཆོས་སྐུ་གཉིས་མེད་རྣམ་པར་དག་པར་མངའ། །
en: {2} “Completely free from fevers, in perfect peace, You have a pure, nondual Dharma body.

source: འགྲོ་བ་མ་ལུས་གཉིས་གནས་པ། །སྤྲུལ་པའི་སྤྲིན་སྒྲ་འབྲུག་གིས་རྣམ་པར་འདུལ། །
en: You guide through the thunder of clouds of emanations All beings, without exception, who are dependent on duality.

source: ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་ལ། །ཁྱོད་ནི་ནམ་ཡང་མི་གནས་མི་རྟེན་ཏེ། །
en: {3} “You are never dependent, never reliant On the skandhas, āyatanas, and dhātus.

source: ཡན་ལག་ཀུན་རྒྱས་གཟུགས་མཆོག་དང་། །དབང་ཕྱུག་ཡོངས་སུ་བསྒྲགས་པས་འགྲོ་བ་འདུལ། །
en: You have a perfect form with all limbs complete, And you guide with your roar of supremacy.

source: ཕྱི་དང་ནང་ལས་རྣམ་པར་གྲོལ། །
en: {4} “You are liberated internally and externally.

source: གཉིས་ལས་བྱུང་བའི་མཚོ་ལས་འཕགས་གྱུར་ཀྱང་། །འཁོར་བའི་རྒྱ་མཚོ་མཐའ་ཡས་པའི། །གཟུགས་བརྙན་འགྲོ་བའི་རྒྱུད་དུ་རབ་ཏུ་སྟོན། །
en: You have risen above the ocean of duality, Yet you manifest illusory forms for beings In the infinite ocean of saṃsāra.

source: ཁྱོད་ལ་གཡོ་བ་མི་མངའ་སྟེ། །
en: {5} “You do not vacillate.

source: ནམ་ཡང་རློམ་སེམས་གཡོ་བའི་སྤྲོས་མི་མངའ། །
en: You are not complicated by pride or hurry.

source: འཇིག་རྟེན་སྤྲོས་མོས་བྱིས་པ་རྣམས། །ཆོས་ཀྱི་རང་བཞིན་སྟོན་ཅིང་འདུལ་བ་མཛད། །
en: You teach the nature of phenomena And guide the fools in the world who delight in complication.

source: ཏིང་འཛིན་རྒྱ་མཚོ་ཀུན་སྤྱོད་པས། །བསྐལ་པ་མང་པོར་རྩེ་གཅིག་ཐུབ་བཞུགས་ཀྱང་། །ཕྱོགས་བཅུའི་བདེ་གཤེགས་མཆོད་དོན་དུ། །སྤུ་རྣམས་རྩེ་ལས་སྤྲུལ་པའི་སྤྲིན་ཀྱང་འགྱེད། །
en: {6} “Through remaining in an ocean of samādhis, Your mind is one-pointed for many kalpas, Yet you emit clouds of emanations from your pores So as to make offerings to the sugatas in the ten directions.

source: སངས་རྒྱས་སྟོབས་ལ་འཇུག་པའི་ཚུལ། །སྐད་ཅིག་རེ་རེར་མཐའ་ཡས་ཐུགས་སུ་ཆུད། །
en: {7} “In every single instant of mind, you comprehend The ways of entering into the strengths of the buddhas.

source: སེམས་ཅན་བསྡུ་བའི་སྦྱོར་བ་རྣམས། །སོ་སོའི་རྐྱེན་བཞིན་གོ་བར་བགྱི་བས་བསྟན། །
en: According to individual circumstances, you manifest The undertakings that will gather beings around you.

source: ཁྱོད་ཀྱིས་སྲིད་པའི་རྒྱ་མཚོ་དག །ལས་ཀྱིས་རྣམ་བྲིས་སྣ་ཚོགས་གཟུགས་གཟིགས་ཤིང་། །
en: {8} “You see the oceans of existence And the various forms painted by karma.

source: ཆོས་ཀྱི་སྒྲིབ་པ་མེད་པའི་ལམ་བསྟན་ཏེ། །སེམས་ཅན་ཀུན་ཀྱང་རྣམ་པར་སྦྱོང་བ་མཛད། །
en: You purify all beings by showing them The unobscured path of the Dharma.
